Revit 2024 API
ConceptualSurfaceType.GetConstructionTypeIds Method
 The element ids of the ConceptualConstructionType's associated with this ConceptualSurfaceType.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ICollection<ElementId> GetConstructionTypeIds()
Visual Basic
Public Function GetConstructionTypeIds As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetConstructionTypeIds()
See Also
ConceptualSurfaceType Class
Autodesk.Revit.DB.Analysis Namespace